public class Main {
    public static void main(String[] args) {

        System.out.println("Здравствуете");  // Объявляете переменные для входных данных и
        int amount = 200; // параметров программы: одну для хранения
        int price = 20;
        int milis = amount / price; // стоимости билета, другую для хранения количества
        System.out.println("Начислино бесплатных миль:" + milis); // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}

